//Работа с переменными
//1. Объявите две переменные: admin и name.
let admin;
let name;
//2. Запишите строку "Джон" в переменную name.
name = "Джон";
//3. Скопируйте значение из переменной name в admin.
admin = name;
//4. Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).*/
alert(admin);

//Придумайте правильные имена
//1. Создайте переменную для названия нашей планеты. Как бы вы её назвали?
let planet = "Марс";
//2. Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?
let currentUser = "Петя";
alert(planet);
alert(currentUser);
//Можно ли использовать заглавные буквы для имени birthday? А для age? Или одновременно для обеих переменных? -- ДА
const BIRTHDAY = "18.04.1982";
const AGE = someCode(BIRTHDAY);
